-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 07, 2022 at 10:10 AM
-- Server version: 10.4.21-MariaDB
-- PHP Version: 8.0.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `km_rice`
--

-- --------------------------------------------------------

--
-- Table structure for table `group_project`
--

CREATE TABLE `group_project` (
  `group_id` int(1) NOT NULL,
  `group_name` varchar(60) NOT NULL,
  `group_pic` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `group_project`
--

INSERT INTO `group_project` (`group_id`, `group_name`, `group_pic`) VALUES
(1, 'ความรู้พื้นฐานการปลูกข้าว', 'https://media.discordapp.net/attachments/940090571903602721/940095501129379904/1.jpg'),
(2, 'นโยบายที่เกี่ยวข้องกับการปลูกข้าว', 'https://media.discordapp.net/attachments/940090571903602721/940095511971639376/2.jpg?width=1202&height=676'),
(3, 'วิกฤติการณ์ที่ส่งผลกระทบต่อการปลูกข้าว', 'https://media.discordapp.net/attachments/940090571903602721/940095521740169236/3.jpg'),
(4, 'เทคโนโลยีที่ใช้ในการผลิตข้าว', 'https://media.discordapp.net/attachments/940090571903602721/940095534591537172/4.jpg'),
(5, 'การเพิ่มมูลค่าให้กับข้าว', 'https://media.discordapp.net/attachments/940090571903602721/940095542397112320/5.jpg'),
(6, 'การตลาดและการประชาสัมพันธ์ ', 'https://media.discordapp.net/attachments/940090571903602721/940096052902637618/6.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `km_unit`
--

CREATE TABLE `km_unit` (
  `km_id` int(11) NOT NULL,
  `km_name` varchar(100) NOT NULL,
  `km_pic` varchar(255) NOT NULL,
  `km_group` int(11) NOT NULL,
  `km_detail` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `km_unit`
--

INSERT INTO `km_unit` (`km_id`, `km_name`, `km_pic`, `km_group`, `km_detail`) VALUES
(1, 'การเตรียมดิน', 'https://media.discordapp.net/attachments/940090571903602721/940090740208435210/aa5d003dc977e545.jpg', 1, 'การไถเตรียมดินมีวัตถุประสงค์ เพื่อกำจัดวัชพืช และทำให้ดินมีสภาพเหมาะแก่การปลูกข้าว การไถครั้งแรกพลิกดินขึ้นมาแล้วเว้นช่วงให้เมล็ดวัชพืชงอก ยิ่งงอกมากยิ่งดี'),
(2, 'การเตรียมเมล็ดพันธ์ข้าว', 'https://media.discordapp.net/attachments/940090571903602721/940090720059002880/3ecfd7ffa8d8e102.jpg', 1, 'ความบริสุทธิ์ของเมล็ดที่ดี ไม่มีพันธุ์อื่น ไม่มีเมล็ดวัชพืช และไม่มีโรคแมลงเจือปนทดสอบความงอกของเมล็ดพันธุ์เสียก่อน เมล็ดพันธุ์ที่ดีควรงอกไม่ต่ ากว่า 80 เปอร์เซ็นต์คัดเมล็ดพันธุ์ที่สมบูรณ์และสม่ำเสมอ โดยการฝัดแยกเมล็ดลีบและสิ่งเจือปนออกทิ้งด้วย'),
(3, 'การปลูกข้าว', 'https://media.discordapp.net/attachments/940090571903602721/940090750765527040/0c4636f1138ef345.jpg', 1, 'เอาเมล็ดพันธุ์หว่านลงไปในพื้นที่นาที่ได้ไถเตรียมดินไว้ การเตรียมดินก็มีการไถดะและไถแปร ปกติชาวนา จะเริ่มไถนา เพื่อปลูกข้าวนาหว่าน ตั้งแต่เดือนเมษายน เนื่องจากพื้นที่นาสำหรับปลูกข้าวนาหว่าน ไม่มีคันนากั้นแบ่งออกเป็นผืนเล็กๆ จึงสะดวกแก่การไถด้วยรถแทรกเตอร์'),
(4, 'การอารักขาข้าว (กำจัดศัตรูข้าว วัชพืช แมลง)', 'https://media.discordapp.net/attachments/940090571903602721/940090763952414720/9f6442abb5a520ae.jpg', 1, 'เมล็ดในการปลูกข้าวนาหว่าน ต้นข้าวต้องการน้ำและ ปุ๋ย สำหรับการเจริญเติบโต ในระยะนี้ ต้นข้าวอาจถูกโรคและแมลงศัตรูข้าวหลายชนิดเข้ามาทำลายต้นข้าว โดยทำให้ต้นข้าวแห้งตาย หรือผลิตผลต่ำและคุณภาพ'),
(5, 'การเกี่ยวข้าว (ระยะพลับพลึงปล่อยน้ำออกจากแปลงนาและเกี่ยวข้าว)', 'https://media.discordapp.net/attachments/940090571903602721/940090681102331934/a144e85b7fee2f7b.jpg?width=1014&height=676', 1, 'เมื่อดอกข้าวบานและมีการผสมเกสรแล้วหนึ่ง สัปดาห์ ภายในที่ห่อหุ้มด้วยเปลือกนอกใหญ่ ก็จะเริ่มเป็นแป้งเหลวสี่ขาว ในสัปดาห์ที่สองแป้งเหลวนั้น ก็จะแห้งกลายเป็นแป้งค่อนข้างแข็ง และในสัปดาห์ที่สาม แป้งก็จะแข็งตัวมากยิ่งขึ้น เป็นรูปร่างของเมล็ดข้าวกล้อง แต่มันจะแก'),
(7, 'นโยบายการพัฒนาระบบชลประทานเพื่อการปลูกข้าว', 'https://media.discordapp.net/attachments/940090571903602721/940090786941390878/c0f259ef86f94242.jpg', 2, 'การเพิ่มประสิทธิภาพที่สําคัญอย่างหนึ่งคือการพัฒนาระบบชลประทาน เนื่องจาก “น้ํา”เป็นปัจจัยการผลิตหลัก โดยจากการศึกษาพบว่า ที่ผ่านมาระบบชลประทานไทยยังพัฒนาได้ไม่ทันกับความต้องการที่เพิ่มขึ้นอย่างรวดเร็ว ที่เห็นได้ชัดคือ “ข้าว” ซึ่งเป็นพืชเศรษฐกิจสําคัญ'),
(8, 'นโยบายการพัฒนาการเกษตร (ปลูกข้าว)', 'https://media.discordapp.net/attachments/940090571903602721/940090705953579089/580fa1d7d90ebc73.jpg', 2, 'ถึงเวลาที่ชาวนาของประเทศต้องเปลี่ยนแปลงไปสู่การทำเกษตรรูปแบบใหม่ คือ การพัฒนาคุณภาพข้าวภายใต้การทำเกษตรอัจฉริยะ (Smart Farming) หรือเกษตร 4.0 ตามนโยบายที่ภาครัฐสนับสนุนให้ภาคการเกษตรนำเทคโนโลยีมาใช้ในการเพิ่มผลผลิต พัฒนาภาคการเกษตรให้ยั่งยืนในอนาคต โดยเปล'),
(9, 'วิกฤติการน้ำท่วม', 'https://media.discordapp.net/attachments/940090571903602721/940090843778392154/e656be606e0bfe7a.jpg', 3, 'อุทกภัยในประเทศไทย พ.ศ. 2554 เป็นอุทกภัยรุนแรงที่เกิดขึ้นระหว่างฤดูมรสุมในประเทศไทย พ.ศ. 2554 เกิดผลกระทบต่อบริเวณลุ่มแม่น้ำเจ้าพระยาและลุ่มน้ำโขง เริ่มตั้งแต่ปลายเดือนกรกฎาคมและสิ้นสุดเมื่อวันที่ 16 มกราคม พ.ศ. 2555 (แต่การฟื้นฟูยังมีต่อเนื่องมาถึงปัจจุบ'),
(10, 'วิกฤติการดินเสื่อมโทรม (การเผาตอซัง น้ำท่วม)', 'https://media.discordapp.net/attachments/940090571903602721/940090808349102140/e06d8097306fae1d.jpg', 3, 'ความเสื่อมโทรมของดินเกิดจากการจัดการที่ดินไม่เหมาะสมขาดการป้องกันที่ไม่ถูกต้อง ทำให้มีการชะล้างพังทลายของหน้าดินที่เป็นส่วนที่มีความอุดมสมบูรณ์หมดไป หน้าดินที่ถูกชะล้างจะตกลงไปเป็นตะกอนตามแหล่งน้ำต่างๆ ก่อให้เกิดการตื้นเขินของแหล่งน้ำทำให้รัฐต้องเสียค่าใช'),
(11, 'แนวทางการแก้ปัญหาที่เกิดจากวิกฤติการณ์น้ำ', 'https://media.discordapp.net/attachments/940090571903602721/940090831128363008/fd6c2d43a466cc3f.jpg', 3, '1.การนำน้ำจากแหล่งอื่นมาใช้ทดแทนในพื้นที่ที่ขาดน้ำ เช่น การผันน้ำตามโครงการ โขง-ชี-มล โดยการสูบน้ำจากแม่น้ำโขงสู่แม่น้ำมูลและแม่น้ำชี หรือการผันน้ำจากแม่น้ำสาละวินเข้าสู่แม่น้ำปิง แล้วเข้าสู่แม่น้ำเจ้าพระยา ก็จะช่วยแก้ปัญหาการขาดแคลนน้ำในพื้นที่ราบลุ่มภาค'),
(12, 'เทคโนโลยีในขั้นตอนการเตรียมดิน', 'https://media.discordapp.net/attachments/940090571903602721/940090694452801606/4a016e019c1e9d03.jpg?width=901&height=676', 4, 'ในปี พ.ศ. ๒๔๙๘ หม่อมราชวงศ์เทพฤทธิ์ เทวกุล หัวหน้ากองท่านแรกของกองเกษตรวิศวกรรม ได้ดำเนินการวิจัยหลายโครงการ งานวิจัยที่สำคัญๆ คือ งานวิจัยประดิษฐ์เครื่องมือเตรียมดิน และชลประทาน ซึ่งก็คือ การพัฒนาวิจัยรถแทรกเตอร์หลายแบบ ตั้งแต่แบบมาตรฐาน ๔ ล้อ แบบ ๓ ล้อ '),
(13, 'เทคโนโลยีในขั้นตอนการปลูก (นาหว่าน นาดำ)', 'https://media.discordapp.net/attachments/940090571903602721/940090798895144980/491591591db5b1b0.png', 4, 'เทคโนโลยีการใช้เครื่องดำนาสามารถใช้เครื่องดำนาได้อย่างมีประสิทธิภาพเร็วกว่าเกษตรกรทั่วไป สามารถปรับแต่งอุปกรณ์หรือแก้ไขข้อขัดข้องในระหว่างการใช้งานในแปลงได้ รู้จักแก้ไขปัญหาเฉพาะหน้าระหว่างการทำงานได้ ไปสู่เกษตรกรในระดับใช้งานจริงในแปลงของเกษตรกร ได้ข้อ'),
(14, 'เทคโนโลยีในขั้นตอนการกำจัดศัตรูพืช (เครื่องพ่น โดรน)', 'https://media.discordapp.net/attachments/940090571903602721/940093505445986344/f7f81c5367c9657e.jpg', 4, 'โดรน มีอีกชื่อนึงว่า UAV (Unmanned Aerial Vehicle) ถูกใช้ในหลากหลายรูปแบบ เช่น ใช้ในการถ่ายรูป/ถ่ายวิดีโอจากมุมสูง ใช้ในการเกษตร และใช้ในการขนส่งสินค้า ซึ่งเป็นบริการที่ทาง google และ amazon กำลังพัฒนาขึ้นเพื่อให้บริการในอนาคต คนส่วนใหญ่ใช้โดรนสำหรับการถ่'),
(15, 'เทคโนโลยีในขั้นตอนการเก็บเกี่ยว (รถเกี่ยวข้าว)', 'https://media.discordapp.net/attachments/940090571903602721/940090857737060362/9f07e2ae33d38abc.jpg', 4, 'เครื่องเกี่ยวนวดได้มีการพัฒนาสร้างโดยกองเกษตรวิศวกรรม กรมการข้าว ในราวปี พ.ศ.๒๕๐๐-๒๕๐๖ จากนั้นราวปี พ.ศ. ๒๕๒๒ ได้มีการนำเข้าเครื่องเกี่ยวนวดจากประเทศญี่ปุ่นมาทดสอบและเผยแพร่โดยหน่วยงานของรัฐและบริษัทเอกชน เครื่องเกี่ยวนวดข้าวแบบญี่ปุ่นเป็นแบบเกี่ยวนวดเฉพา'),
(16, 'เทคโนโลยีเพื่องานระบบสารสนเทศ (LDD Farm Land use Planning)', 'https://media.discordapp.net/attachments/940090571903602721/940090666778767390/LDD.png', 4, 'แอปพลิเคชันเพื่อวางแผนการใช้ที่ดินเกษตรกรรายแปลงเมื่อบริหารจัดการแปลงเสร็จเรียบร้อยแล้ว ระบบจะคำนวณต้นทุนการผลิต และคาดการณ์ผลผลิต ประจำแปลง รายรับ-รายจ่าย ผลกำไรขาดทุน และสรุปข้อมูลให้เกษตรกรเป็นรายแปลง'),
(17, 'การเพิ่มมูลค่าจากผลพลอยได้จากการปลูกข้าวเพื่อสร้างรายได้ (รำ ฟางข้าวนำมาเลี้ยงสัตว์)', 'https://media.discordapp.net/attachments/940090571903602721/940090869032308776/2cb7e7b801408a06.jpg', 5, 'ส่วนที่ได้จากการขัดข้าวกล้องให้เป็นข้าวสาร ซึ่งประกอบด้วยชั้นเยื่อหุ้มเมล็ด และคัพภะ เป็นส่วนใหญ่ ซึ่งได้จากกระบวนการสีข้าว โดยทั่วไปจะแบ่งออกเป็น 2 ส่วน คือ รำหยาบ (bran) ซึ่งได้จากการขัดผิวเมล็ดข้าวกล้อง และรำละเอียด (polish) ได้จากการขัดขาวและขัดมัน นอ'),
(18, 'การเพิ่มมูลค่าข้าวจากการแปรรูปข้าวเพื่อสร้างรายได้ (ข้าวตัง)', 'https://media.discordapp.net/attachments/940090571903602721/940090774454947880/058da54fc076b976.jpg', 5, 'วิธีทำข้าวตังแบบโบราณก็คือ ตั้งกระทะต่อให้ข้าวก้นหม้อแข็งกรอบ เมื่อข้าวเริ่มแข็งล่อนออกจากก้นหม้อแล้วจึง ‘ยา’ หรือปรุงด้วยน้ำปรุงเพิ่มรสชาติ น้ำปรุงข้าวตังนี้มีสูตรแตกต่างกันไปตามพื้นที่ บางที่ใช้น้ำมันเป็นหลักเพื่อเพิ่มความกรอบร่วนให้ข้าวตัง บางที่ใช้มัน'),
(19, 'การตลาดและประชาสัมพันธ์ด้วยการจำหน่ายแบบขายตรงผ่านสื่อออนไลน์ (facebook shopee Lazada)', 'https://media.discordapp.net/attachments/940090571903602721/940090654111961088/facebook.png', 6, '1.สามารถเลือกเข้าถึงกลุ่มเป้าหมายได้ เพราะข้อมูลชัดเจนเกี่ยวกับผู้บริโภค ทำให้ลดการ สูญเปล่าในการใช้สื่อ และสื่อสารได้อย่างมีประสิทธิภาพสูง ตัวอย่างเช่น การทำการตลาดเปิดตัวรถยนต์โฟก์สวากอน New Bettle ในไทยที่มีการใช้การประมูลรถผ่าน website www.thailifesty'),
(20, 'การตลาดและประชาสัมพันธ์ด้วยการจำหน่ายแบบขายโดยเกษตรกรผ่านตลาดเกษตรในจังหวัด', 'https://media.discordapp.net/attachments/940090571903602721/940090822123196456/408f74f87c0509e3.jpg?width=676&height=676', 6, 'ตลาดเกษตรกร โครงการสำคัญจากกรมส่งเสริมการเกษตร สนับสนุนให้ทุกจังหวัดมีสถานที่จำหน่ายผลผลิตและผลิตภัณฑ์ทางการเกษตรที่มีคุณภาพ ปลอดภัย ได้รับการรับรองมาตรฐาน ผ่านกลไกเกษตรจังหวัด ซึ่งจะรับหน้าที่เป็นผู้จัดการตลาดเกษตร ขับเคลื่อนและผลักดันตลาดเกษตรกรให้เป็นช'),
(45, 'รถไถ', 'https://media.discordapp.net/attachments/940090571903602721/940169254391668776/551470edd3558d87.png', 4, 'รถไถไฟฟ้า');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `group_project`
--
ALTER TABLE `group_project`
  ADD PRIMARY KEY (`group_id`);

--
-- Indexes for table `km_unit`
--
ALTER TABLE `km_unit`
  ADD PRIMARY KEY (`km_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `group_project`
--
ALTER TABLE `group_project`
  MODIFY `group_id` int(1) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `km_unit`
--
ALTER TABLE `km_unit`
  MODIFY `km_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
